app/views/posts/_form.html.erb

    <p>레시피 종류</p>
    <%= form.collection_select :category_id, Category.all, :id, :name %>
---
SELECT "categories".* FROM "categories"