app/views/posts/_post.html.erb

  <div class="main-category">
    <% Category.all.each do |p| %>
---
SELECT "categories".* FROM "categories"