app/controllers/posts_controller.rb

  def hashtags
    tag = Tag.find_by(name: params[:name])
---
SELECT  "tags".* FROM "tags" WHERE "tags"."name" = ? LIMIT ?  [["name", "갈비"], ["LIMIT", 1]]

  def index
    @posts = Post.all
    @posts = Post.order('created_at DESC')
---
SELECT "posts".* FROM "posts" ORDER BY created_at DESC

  def show
    @post_attachments = @post.post_attachments.all
---
SELECT "post_attachments".* FROM "post_attachments" WHERE "post_attachments"."post_id" = ?  [["post_id", 1]]

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
        params[:post_attachments]['avatar'].each do |a|
          @post_attachment = @post.post_attachments.create!(:avatar => a)
---
INSERT INTO "posts" ("title", "temperature", "time", "description", "image", "created_at", "updated_at", "category_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "post_attachments" ("post_id", "avatar", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["post_id", 5], ["avatar", "awdawd.jpg"], ["created_at", "2019-02-15 10:56:01.078118"], ["updated_at", "2019-02-15 10:56:01.078118"]]