app/models/post.rb

  has_and_belongs_to_many :tags

  after_create do
      post = Post.find_by(id: self.id)
      hashtags = self.description.scan(/[#＃][a-z|A-Z|가-힣|0-9|\w]+/)
      hashtags.uniq.map do |hashtag|
          tag = Tag.find_or_create_by(name: hashtag.downcase.delete('#'))
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "갈비"], ["created_at", "2019-02-15 08:57:30.081298"], ["updated_at", "2019-02-15 08:57:30.081298"]]
SELECT  "tags".* FROM "tags" WHERE "tags"."name" = ? LIMIT ?  [["name", "갈비"], ["LIMIT", 1]]